# 動手做 ----------------------------------

# Example 酒類市場銷售分析

#### 題目: 讀取drinks.csv ，進行銷售分析:
* 啤酒(beer_servings)銷售分析
    * 各洲(continent)啤酒(beer_servings)平均銷售量？ 請依序排列。
    * 請列出前五個國家購買啤酒(beer_servings)最多的國家(country)。

* 紅酒(wine_servings銷售分析
    * 以describe()，列出各洲continent的紅酒的銷售分析(count, mean, std, min, 25%,	50%, 75%,max)
    * 
    
* 烈酒(spirit_servings)銷售分析
    * 各洲continent在烈酒spirit_servings飲料市場中，單一國家的平均銷量和最大銷量
    * 烈酒spirit_servings在各洲continent的總銷售量
    
* 將烈酒spirit_servings在各洲continent的總銷售量，寫進spirit_data.csv

In [3]:
import pandas as pd

path = 'drinks.csv'
drinks = pd.read_csv(path) 

drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

* 啤酒(beer_servings)銷售分析
    * 各洲(continent)啤酒(beer_servings)平均銷售量？ 請依序排列。

In [4]:
drinks.groupby('continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

* 啤酒(beer_servings)銷售分析
    * 請列出前五個國家購買啤酒(beer_servings)最多的國家(country)。

In [5]:
beer_top5 = drinks.sort_values(by='beer_servings', ascending = False)
beer_top5[:5]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
117,Namibia,376,3,1,6.8,AF
45,Czech Republic,361,170,134,11.8,EU
62,Gabon,347,98,59,8.9,AF
65,Germany,346,117,175,11.3,EU
98,Lithuania,343,244,56,12.9,EU

In [8]:
beer_top = drinks.sort_values(by='beer_servings', ascending = False)
a = beer_top.loc[:,['country','beer_servings']]
a[:5]

            country  beer_servings
117         Namibia            376
45   Czech Republic            361
62            Gabon            347
65          Germany            346
98        Lithuania            343

* 紅酒(wine_servings銷售分析
    * 以describe()，列出各洲continent的紅酒的銷售分析(count, mean, std, min, 25%,	50%, 75%,max)

In [8]:
drinks.groupby('continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

* 烈酒(spirit_servings)銷售分析
    * 各洲continent在烈酒spirit_servings飲料市場中，單一國家的平均銷量和最大銷量

In [10]:
spirit_data = drinks.groupby('continent').spirit_servings.agg(['mean', 'max'])
spirit_data.round(2)

             mean  max
continent
AF          16.34  152
AS          60.84  326
EU         132.56  373
OC          58.44  254
SA         114.75  302

* 烈酒(spirit_servings)銷售分析
    * 烈酒spirit_servings在各洲continent的總銷售量

In [11]:
drinks.groupby('continent').spirit_servings.sum()

continent
AF     866
AS    2677
EU    5965
OC     935
SA    1377
Name: spirit_servings, dtype: int64

* 將烈酒spirit_servings在各洲continent的總銷售量，寫進spirit_data.csv

In [25]:
spirit_data

             mean  max
continent
AF          16.34  152
AS          60.84  326
EU         132.56  373
OC          58.44  254
SA         114.75  302

In [26]:
spirit_data.reset_index(inplace=True)
spirit_data.to_csv('spirit_data.csv', encoding='utf-8', index=False)

# 補充說明

In [33]:
import numpy as np
df = pd.DataFrame([[1, 2], [9, 4], [8, 5]], columns=['A', 'B'])

df

   A  B
0  1  2
1  9  4
2  8  5

In [36]:
df['C']=['AU', 'JP', 'JP']
df

   A  B   C
0  1  2  AU
1  9  4  JP
2  8  5  JP

In [32]:
df.agg({'A' : ['mean', 'min', 'max']})

        A
mean  6.0
min   1.0
max   9.0

In [29]:
df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

        A    B
max   NaN  5.0
min   1.0  2.0
sum  18.0  NaN

In [37]:
df.groupby('C').A.agg(['mean', 'min', 'max'])

    mean  min  max
C
AU   1.0    1    1
JP   8.5    8    9

# 動手做 ----------------------------------

#  台灣汽柴油市場銷售分析

#### 題目: 讀取oil2013.xlsx ，進行銷售分析:
* 將縣市別設為index
* 汽油、柴油的總體平均銷售量
* 列出汽油銷售前五的縣市
* 柴油的最大銷量的縣市

In [12]:
import pandas as pd
import numpy as np
oil = pd.read_excel('oil2013.xlsx')

oil.head()

   縣市別     汽　油    柴　油
0  臺北市   56258   7636
1  新北市  101741  33377
2  桃園市   85885  46324
3  臺中市  103360  48412
4  臺南市   72462  35555

In [ ]:
* 將縣市別設為index

In [13]:
oil_top5 = oil.sort_values(by='汽　油', ascending = False)
data_oil = oil_top5.iloc[0:5,0]
data_oil

3    臺中市
1    新北市
2    桃園市
5    高雄市
4    臺南市
Name: 縣市別, dtype: object

In [ ]:
* 汽油、柴油的總體平均銷售量

In [14]:
oil.describe().mean()

汽　油    32199.218463
柴　油    14663.711376
dtype: float64

In [ ]:
* 列出汽油銷售前五的縣市

In [15]:
oil = oil.set_index('縣市別', drop = True)
oil.head()

        汽　油    柴　油
縣市別
臺北市   56258   7636
新北市  101741  33377
桃園市   85885  46324
臺中市  103360  48412
臺南市   72462  35555

In [18]:
oil_top5 = oil.sort_values(by='汽　油', ascending = False)
data2_oil = oil_top5.iloc[0:5,0]
data2_oil

縣市別
臺中市    103360
新北市    101741
桃園市     85885
高雄市     80668
臺南市     72462
Name: 汽　油, dtype: int64

In [ ]:
* 柴油的最大銷量的縣市

In [16]:
print(oil[oil['柴　油'] == oil['柴　油'].max()])

        汽　油    柴　油
縣市別
臺中市  103360  48412

In [17]:
a = oil[oil['柴　油'] == oil['柴　油'].max()]
a['柴　油']

縣市別
臺中市    48412
Name: 柴　油, dtype: int64

# 補充

# write CSV file

In [4]:
# concatenate multiple dataframe 
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})


df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']})

frames = [df1, df2, df3]

result = pd.concat(frames, ignore_index=True)
print(result) 

#save to csv file
df1.to_csv('data-001.csv', encoding='utf-8', index=False)
df2.to_csv('data-002.csv', encoding='utf-8', index=False)
df3.to_csv('data-003.csv', encoding='utf-8', index=False)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
---------------------
---------------------

In [ ]:
# combine CSV file

In [3]:
#read data from multiple .csv file and concatenate all datafram using append
import os, sys,glob
from pathlib import Path

total_files=3
path = "./" 
df=pd.DataFrame()  #empty dataframe

#print(df.shape)

for i in range(total_files):
    buf = "data-%03d.csv"%(i+1)      # csv檔名固定3位
    buf=os.path.join(path, buf)
    print(buf)
    print('---------------------')
    df2=pd.read_csv(buf)
    df=df.append(df2,ignore_index=True)

    
print(df)

./data-001.csv
---------------------
./data-002.csv
---------------------
./data-003.csv
---------------------
      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11